print("Здраствуйте это игра spider man:Begin Сюжет: Bас укусил радиоактивный паук и у вас поевились силы ходить по стенам стрелять паутиной вы сильные и у вас чуйка")
x=input("выберете 1.пойти драться 2.не пойти")
if x== "1":
    print("вы полетели на паутине к боссу")
    exit()
x=input("вы прилетели к боссу у вас есть выбор 1.ударить рукой усталость минус 5(у вас 100 сил каждый удар рукой по -5 сил)2.ударить ногой -10 сил ")
if x== "1":
    print("вы ударили рукой у босса 90 хп осталось") 
if x== "2":
    print("вы ударирили ногой минус 15 хп босса у него 85 хп")
    
